dvdfreitag/ocarina/CMSIS/devices/same70q21/include/component/pwm.h
#define PWM_IMR2_CMPM_Pos                   8                                              /**< (PWM_IMR2 Position) Comparison x Match Interrupt Mask */
#define PWM_IMR2_CMPM_Msk                   (_U_(0xFF) << PWM_IMR2_CMPM_Pos)               /**< (PWM_IMR2 Mask) CMPM */
#define PWM_IMR2_CMPM(value)                (PWM_IMR2_CMPM_Msk & ((value) << PWM_IMR2_CMPM_Pos))  
#define PWM_IMR2_CMPU_Pos                   16                                             /**< (PWM_IMR2 Position) Comparison 7 Update Interrupt Mask */
#define PWM_IMR2_CMPU_Msk                   (_U_(0xFF) << PWM_IMR2_CMPU_Pos)               /**< (PWM_IMR2 Mask) CMPU */
#define PWM_IMR2_CMPU(value)                (PWM_IMR2_CMPU_Msk & ((value) << PWM_IMR2_CMPU_Pos))  

/* -------- PWM_ISR2 : (PWM Offset: 0x40) (R/ 32) PWM Interrupt Status Register 2 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WRDY:1;                    /**< bit:      0  Write Ready for Synchronous Channels Update */
    uint32_t :2;                        /**< bit:   1..2  Reserved */
    uint32_t UNRE:1;                    /**< bit:      3  Synchronous Channels Update Underrun Error */
    uint32_t :4;                        /**< bit:   4..7  Reserved */
    uint32_t CMPM0:1;                   /**< bit:      8  Comparison 0 Match                       */
    uint32_t CMPM1:1;                   /**< bit:      9  Comparison 1 Match                       */
    uint32_t CMPM2:1;                   /**< bit:     10  Comparison 2 Match                       */
    uint32_t CMPM3:1;                   /**< bit:     11  Comparison 3 Match                       */
    uint32_t CMPM4:1;                   /**< bit:     12  Comparison 4 Match                       */
    uint32_t CMPM5:1;                   /**< bit:     13  Comparison 5 Match                       */
    uint32_t CMPM6:1;                   /**< bit:     14  Comparison 6 Match                       */
    uint32_t CMPM7:1;                   /**< bit:     15  Comparison 7 Match                       */
    uint32_t CMPU0:1;                   /**< bit:     16  Comparison 0 Update                      */
    uint32_t CMPU1:1;                   /**< bit:     17  Comparison 1 Update                      */
    uint32_t CMPU2:1;                   /**< bit:     18  Comparison 2 Update                      */
    uint32_t CMPU3:1;                   /**< bit:     19  Comparison 3 Update                      */
    uint32_t CMPU4:1;                   /**< bit:     20  Comparison 4 Update                      */
    uint32_t CMPU5:1;                   /**< bit:     21  Comparison 5 Update                      */
    uint32_t CMPU6:1;                   /**< bit:     22  Comparison 6 Update                      */
    uint32_t CMPU7:1;                   /**< bit:     23  Comparison 7 Update                      */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t :8;                        /**< bit:   0..7  Reserved */
    uint32_t CMPM:8;                    /**< bit:  8..15  Comparison x Match                       */
    uint32_t CMPU:8;                    /**< bit: 16..23  Comparison 7 Update                      */
    uint32_t :8;                        /**< bit: 24..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_ISR2_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_ISR2_OFFSET                     (0x40)                                        /**<  (PWM_ISR2) PWM Interrupt Status Register 2  Offset */

#define PWM_ISR2_WRDY_Pos                   0                                              /**< (PWM_ISR2) Write Ready for Synchronous Channels Update Position */
#define PWM_ISR2_WRDY_Msk                   (_U_(0x1) << PWM_ISR2_WRDY_Pos)                /**< (PWM_ISR2) Write Ready for Synchronous Channels Update Mask */
#define PWM_ISR2_WRDY                       PWM_ISR2_WRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_WRDY_Msk instead */
#define PWM_ISR2_UNRE_Pos                   3                                              /**< (PWM_ISR2) Synchronous Channels Update Underrun Error Position */
#define PWM_ISR2_UNRE_Msk                   (_U_(0x1) << PWM_ISR2_UNRE_Pos)                /**< (PWM_ISR2) Synchronous Channels Update Underrun Error Mask */
#define PWM_ISR2_UNRE                       PWM_ISR2_UNRE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_UNRE_Msk instead */
#define PWM_ISR2_CMPM0_Pos                  8                                              /**< (PWM_ISR2) Comparison 0 Match Position */
#define PWM_ISR2_CMPM0_Msk                  (_U_(0x1) << PWM_ISR2_CMPM0_Pos)               /**< (PWM_ISR2) Comparison 0 Match Mask */
#define PWM_ISR2_CMPM0                      PWM_ISR2_CMPM0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPM0_Msk instead */
#define PWM_ISR2_CMPM1_Pos                  9                                              /**< (PWM_ISR2) Comparison 1 Match Position */
#define PWM_ISR2_CMPM1_Msk                  (_U_(0x1) << PWM_ISR2_CMPM1_Pos)               /**< (PWM_ISR2) Comparison 1 Match Mask */
#define PWM_ISR2_CMPM1                      PWM_ISR2_CMPM1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPM1_Msk instead */
#define PWM_ISR2_CMPM2_Pos                  10                                             /**< (PWM_ISR2) Comparison 2 Match Position */
#define PWM_ISR2_CMPM2_Msk                  (_U_(0x1) << PWM_ISR2_CMPM2_Pos)               /**< (PWM_ISR2) Comparison 2 Match Mask */
#define PWM_ISR2_CMPM2                      PWM_ISR2_CMPM2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPM2_Msk instead */
#define PWM_ISR2_CMPM3_Pos                  11                                             /**< (PWM_ISR2) Comparison 3 Match Position */
#define PWM_ISR2_CMPM3_Msk                  (_U_(0x1) << PWM_ISR2_CMPM3_Pos)               /**< (PWM_ISR2) Comparison 3 Match Mask */
#define PWM_ISR2_CMPM3                      PWM_ISR2_CMPM3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPM3_Msk instead */
#define PWM_ISR2_CMPM4_Pos                  12                                             /**< (PWM_ISR2) Comparison 4 Match Position */
#define PWM_ISR2_CMPM4_Msk                  (_U_(0x1) << PWM_ISR2_CMPM4_Pos)               /**< (PWM_ISR2) Comparison 4 Match Mask */
#define PWM_ISR2_CMPM4                      PWM_ISR2_CMPM4_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPM4_Msk instead */
#define PWM_ISR2_CMPM5_Pos                  13                                             /**< (PWM_ISR2) Comparison 5 Match Position */
#define PWM_ISR2_CMPM5_Msk                  (_U_(0x1) << PWM_ISR2_CMPM5_Pos)               /**< (PWM_ISR2) Comparison 5 Match Mask */
#define PWM_ISR2_CMPM5                      PWM_ISR2_CMPM5_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPM5_Msk instead */
#define PWM_ISR2_CMPM6_Pos                  14                                             /**< (PWM_ISR2) Comparison 6 Match Position */
#define PWM_ISR2_CMPM6_Msk                  (_U_(0x1) << PWM_ISR2_CMPM6_Pos)               /**< (PWM_ISR2) Comparison 6 Match Mask */
#define PWM_ISR2_CMPM6                      PWM_ISR2_CMPM6_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPM6_Msk instead */
#define PWM_ISR2_CMPM7_Pos                  15                                             /**< (PWM_ISR2) Comparison 7 Match Position */
#define PWM_ISR2_CMPM7_Msk                  (_U_(0x1) << PWM_ISR2_CMPM7_Pos)               /**< (PWM_ISR2) Comparison 7 Match Mask */
#define PWM_ISR2_CMPM7                      PWM_ISR2_CMPM7_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPM7_Msk instead */
#define PWM_ISR2_CMPU0_Pos                  16                                             /**< (PWM_ISR2) Comparison 0 Update Position */
#define PWM_ISR2_CMPU0_Msk                  (_U_(0x1) << PWM_ISR2_CMPU0_Pos)               /**< (PWM_ISR2) Comparison 0 Update Mask */
#define PWM_ISR2_CMPU0                      PWM_ISR2_CMPU0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPU0_Msk instead */
#define PWM_ISR2_CMPU1_Pos                  17                                             /**< (PWM_ISR2) Comparison 1 Update Position */
#define PWM_ISR2_CMPU1_Msk                  (_U_(0x1) << PWM_ISR2_CMPU1_Pos)               /**< (PWM_ISR2) Comparison 1 Update Mask */
#define PWM_ISR2_CMPU1                      PWM_ISR2_CMPU1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPU1_Msk instead */
#define PWM_ISR2_CMPU2_Pos                  18                                             /**< (PWM_ISR2) Comparison 2 Update Position */
#define PWM_ISR2_CMPU2_Msk                  (_U_(0x1) << PWM_ISR2_CMPU2_Pos)               /**< (PWM_ISR2) Comparison 2 Update Mask */
#define PWM_ISR2_CMPU2                      PWM_ISR2_CMPU2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPU2_Msk instead */
#define PWM_ISR2_CMPU3_Pos                  19                                             /**< (PWM_ISR2) Comparison 3 Update Position */
#define PWM_ISR2_CMPU3_Msk                  (_U_(0x1) << PWM_ISR2_CMPU3_Pos)               /**< (PWM_ISR2) Comparison 3 Update Mask */
#define PWM_ISR2_CMPU3                      PWM_ISR2_CMPU3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPU3_Msk instead */
#define PWM_ISR2_CMPU4_Pos                  20                                             /**< (PWM_ISR2) Comparison 4 Update Position */
#define PWM_ISR2_CMPU4_Msk                  (_U_(0x1) << PWM_ISR2_CMPU4_Pos)               /**< (PWM_ISR2) Comparison 4 Update Mask */
#define PWM_ISR2_CMPU4                      PWM_ISR2_CMPU4_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPU4_Msk instead */
#define PWM_ISR2_CMPU5_Pos                  21                                             /**< (PWM_ISR2) Comparison 5 Update Position */
#define PWM_ISR2_CMPU5_Msk                  (_U_(0x1) << PWM_ISR2_CMPU5_Pos)               /**< (PWM_ISR2) Comparison 5 Update Mask */
#define PWM_ISR2_CMPU5                      PWM_ISR2_CMPU5_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPU5_Msk instead */
#define PWM_ISR2_CMPU6_Pos                  22                                             /**< (PWM_ISR2) Comparison 6 Update Position */
#define PWM_ISR2_CMPU6_Msk                  (_U_(0x1) << PWM_ISR2_CMPU6_Pos)               /**< (PWM_ISR2) Comparison 6 Update Mask */
#define PWM_ISR2_CMPU6                      PWM_ISR2_CMPU6_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPU6_Msk instead */
#define PWM_ISR2_CMPU7_Pos                  23                                             /**< (PWM_ISR2) Comparison 7 Update Position */
#define PWM_ISR2_CMPU7_Msk                  (_U_(0x1) << PWM_ISR2_CMPU7_Pos)               /**< (PWM_ISR2) Comparison 7 Update Mask */
#define PWM_ISR2_CMPU7                      PWM_ISR2_CMPU7_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ISR2_CMPU7_Msk instead */
#define PWM_ISR2_MASK                       _U_(0xFFFF09)                                  /**< \deprecated (PWM_ISR2) Register MASK  (Use PWM_ISR2_Msk instead)  */
#define PWM_ISR2_Msk                        _U_(0xFFFF09)                                  /**< (PWM_ISR2) Register Mask  */

#define PWM_ISR2_CMPM_Pos                   8                                              /**< (PWM_ISR2 Position) Comparison x Match */
#define PWM_ISR2_CMPM_Msk                   (_U_(0xFF) << PWM_ISR2_CMPM_Pos)               /**< (PWM_ISR2 Mask) CMPM */
#define PWM_ISR2_CMPM(value)                (PWM_ISR2_CMPM_Msk & ((value) << PWM_ISR2_CMPM_Pos))  
#define PWM_ISR2_CMPU_Pos                   16                                             /**< (PWM_ISR2 Position) Comparison 7 Update */
#define PWM_ISR2_CMPU_Msk                   (_U_(0xFF) << PWM_ISR2_CMPU_Pos)               /**< (PWM_ISR2 Mask) CMPU */
#define PWM_ISR2_CMPU(value)                (PWM_ISR2_CMPU_Msk & ((value) << PWM_ISR2_CMPU_Pos))  

/* -------- PWM_OOV : (PWM Offset: 0x44) (R/W 32) PWM Output Override Value Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t OOVH0:1;                   /**< bit:      0  Output Override Value for PWMH output of the channel 0 */
    uint32_t OOVH1:1;                   /**< bit:      1  Output Override Value for PWMH output of the channel 1 */
    uint32_t OOVH2:1;                   /**< bit:      2  Output Override Value for PWMH output of the channel 2 */
    uint32_t OOVH3:1;                   /**< bit:      3  Output Override Value for PWMH output of the channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t OOVL0:1;                   /**< bit:     16  Output Override Value for PWML output of the channel 0 */
    uint32_t OOVL1:1;                   /**< bit:     17  Output Override Value for PWML output of the channel 1 */
    uint32_t OOVL2:1;                   /**< bit:     18  Output Override Value for PWML output of the channel 2 */
    uint32_t OOVL3:1;                   /**< bit:     19  Output Override Value for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t OOVH:4;                    /**< bit:   0..3  Output Override Value for PWMH output of the channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t OOVL:4;                    /**< bit: 16..19  Output Override Value for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_OOV_Type;
