dvdfreitag/ocarina/CMSIS/devices/same70q21/include/component/pwm.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_OOV_OFFSET                      (0x44)                                        /**<  (PWM_OOV) PWM Output Override Value Register  Offset */

#define PWM_OOV_OOVH0_Pos                   0                                              /**< (PWM_OOV) Output Override Value for PWMH output of the channel 0 Position */
#define PWM_OOV_OOVH0_Msk                   (_U_(0x1) << PWM_OOV_OOVH0_Pos)                /**< (PWM_OOV) Output Override Value for PWMH output of the channel 0 Mask */
#define PWM_OOV_OOVH0                       PWM_OOV_OOVH0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OOV_OOVH0_Msk instead */
#define PWM_OOV_OOVH1_Pos                   1                                              /**< (PWM_OOV) Output Override Value for PWMH output of the channel 1 Position */
#define PWM_OOV_OOVH1_Msk                   (_U_(0x1) << PWM_OOV_OOVH1_Pos)                /**< (PWM_OOV) Output Override Value for PWMH output of the channel 1 Mask */
#define PWM_OOV_OOVH1                       PWM_OOV_OOVH1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OOV_OOVH1_Msk instead */
#define PWM_OOV_OOVH2_Pos                   2                                              /**< (PWM_OOV) Output Override Value for PWMH output of the channel 2 Position */
#define PWM_OOV_OOVH2_Msk                   (_U_(0x1) << PWM_OOV_OOVH2_Pos)                /**< (PWM_OOV) Output Override Value for PWMH output of the channel 2 Mask */
#define PWM_OOV_OOVH2                       PWM_OOV_OOVH2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OOV_OOVH2_Msk instead */
#define PWM_OOV_OOVH3_Pos                   3                                              /**< (PWM_OOV) Output Override Value for PWMH output of the channel 3 Position */
#define PWM_OOV_OOVH3_Msk                   (_U_(0x1) << PWM_OOV_OOVH3_Pos)                /**< (PWM_OOV) Output Override Value for PWMH output of the channel 3 Mask */
#define PWM_OOV_OOVH3                       PWM_OOV_OOVH3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OOV_OOVH3_Msk instead */
#define PWM_OOV_OOVL0_Pos                   16                                             /**< (PWM_OOV) Output Override Value for PWML output of the channel 0 Position */
#define PWM_OOV_OOVL0_Msk                   (_U_(0x1) << PWM_OOV_OOVL0_Pos)                /**< (PWM_OOV) Output Override Value for PWML output of the channel 0 Mask */
#define PWM_OOV_OOVL0                       PWM_OOV_OOVL0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OOV_OOVL0_Msk instead */
#define PWM_OOV_OOVL1_Pos                   17                                             /**< (PWM_OOV) Output Override Value for PWML output of the channel 1 Position */
#define PWM_OOV_OOVL1_Msk                   (_U_(0x1) << PWM_OOV_OOVL1_Pos)                /**< (PWM_OOV) Output Override Value for PWML output of the channel 1 Mask */
#define PWM_OOV_OOVL1                       PWM_OOV_OOVL1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OOV_OOVL1_Msk instead */
#define PWM_OOV_OOVL2_Pos                   18                                             /**< (PWM_OOV) Output Override Value for PWML output of the channel 2 Position */
#define PWM_OOV_OOVL2_Msk                   (_U_(0x1) << PWM_OOV_OOVL2_Pos)                /**< (PWM_OOV) Output Override Value for PWML output of the channel 2 Mask */
#define PWM_OOV_OOVL2                       PWM_OOV_OOVL2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OOV_OOVL2_Msk instead */
#define PWM_OOV_OOVL3_Pos                   19                                             /**< (PWM_OOV) Output Override Value for PWML output of the channel 3 Position */
#define PWM_OOV_OOVL3_Msk                   (_U_(0x1) << PWM_OOV_OOVL3_Pos)                /**< (PWM_OOV) Output Override Value for PWML output of the channel 3 Mask */
#define PWM_OOV_OOVL3                       PWM_OOV_OOVL3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OOV_OOVL3_Msk instead */
#define PWM_OOV_MASK                        _U_(0xF000F)                                   /**< \deprecated (PWM_OOV) Register MASK  (Use PWM_OOV_Msk instead)  */
#define PWM_OOV_Msk                         _U_(0xF000F)                                   /**< (PWM_OOV) Register Mask  */

#define PWM_OOV_OOVH_Pos                    0                                              /**< (PWM_OOV Position) Output Override Value for PWMH output of the channel x */
#define PWM_OOV_OOVH_Msk                    (_U_(0xF) << PWM_OOV_OOVH_Pos)                 /**< (PWM_OOV Mask) OOVH */
#define PWM_OOV_OOVH(value)                 (PWM_OOV_OOVH_Msk & ((value) << PWM_OOV_OOVH_Pos))  
#define PWM_OOV_OOVL_Pos                    16                                             /**< (PWM_OOV Position) Output Override Value for PWML output of the channel 3 */
#define PWM_OOV_OOVL_Msk                    (_U_(0xF) << PWM_OOV_OOVL_Pos)                 /**< (PWM_OOV Mask) OOVL */
#define PWM_OOV_OOVL(value)                 (PWM_OOV_OOVL_Msk & ((value) << PWM_OOV_OOVL_Pos))  

/* -------- PWM_OS : (PWM Offset: 0x48) (R/W 32) PWM Output Selection Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t OSH0:1;                    /**< bit:      0  Output Selection for PWMH output of the channel 0 */
    uint32_t OSH1:1;                    /**< bit:      1  Output Selection for PWMH output of the channel 1 */
    uint32_t OSH2:1;                    /**< bit:      2  Output Selection for PWMH output of the channel 2 */
    uint32_t OSH3:1;                    /**< bit:      3  Output Selection for PWMH output of the channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t OSL0:1;                    /**< bit:     16  Output Selection for PWML output of the channel 0 */
    uint32_t OSL1:1;                    /**< bit:     17  Output Selection for PWML output of the channel 1 */
    uint32_t OSL2:1;                    /**< bit:     18  Output Selection for PWML output of the channel 2 */
    uint32_t OSL3:1;                    /**< bit:     19  Output Selection for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t OSH:4;                     /**< bit:   0..3  Output Selection for PWMH output of the channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t OSL:4;                     /**< bit: 16..19  Output Selection for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_OS_Type;
